lisyaoran51/Pic32Test/MM0064GPM064_AllFunctionTest.X/mcc_generated_files/pin_manager.h
    // Read RB7
    postValue = IO_RB7_GetValue();
    </code>

*/
#define IO_RB7_GetValue()         PORTBbits.RB7
/**
  @Summary
    Configures the GPIO pin, RB7, as an input.

  @Description
    Configures the GPIO pin, RB7, as an input.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Sets the RB7 as an input
    IO_RB7_SetDigitalInput();
    </code>

*/
#define IO_RB7_SetDigitalInput()   ( TRISBSET = (1 << 7) )
/**
  @Summary
    Configures the GPIO pin, RB7, as an output.

  @Description
    Configures the GPIO pin, RB7, as an output.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Sets the RB7 as an output
    IO_RB7_SetDigitalOutput();
    </code>

*/
#define IO_RB7_SetDigitalOutput()   ( TRISBCLR = (1 << 7) )
/**
  @Summary
    Sets the GPIO pin, RC10, high using LATC10.

  @Description
    Sets the GPIO pin, RC10, high using LATC10.

  @Preconditions
    The RC10 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Set RC10 high (1)
    IO_RC10_SetHigh();
    </code>

*/
#define IO_RC10_SetHigh()          ( LATCSET = (1 << 10) )
/**
  @Summary
    Sets the GPIO pin, RC10, low using LATC10.

  @Description
    Sets the GPIO pin, RC10, low using LATC10.

  @Preconditions
    The RC10 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Set RC10 low (0)
    IO_RC10_SetLow();
    </code>

*/
#define IO_RC10_SetLow()           ( LATCCLR = (1 << 10) )

/**
  @Summary
    Sets a value to the GPIO pin.

  @Description
    Sets or Resets the GPIO pin, RC10, low or high using LATC10.

  @Preconditions
    The RC10 must be set to an output.

  @Returns
    None.

  @Param
    bool value; : value to be set to the GPIO pin.

  @Example
    <code>
    // Set RC10 to low.
    IO_RC10_SetValue(false);
    </code>

*/
inline static void IO_RC10_SetValue(bool value)
{
  if(value)
  {
    IO_RC10_SetHigh();
  }
  else
  {
    IO_RC10_SetLow();
  }
}

/**
  @Summary
    Toggles the GPIO pin, RC10, using LATC10.

  @Description
    Toggles the GPIO pin, RC10, using LATC10.

  @Preconditions
    The RC10 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Toggle RC10
    IO_RC10_Toggle();
    </code>

*/
#define IO_RC10_Toggle()           ( LATCINV = (1 << 10) )
/**
  @Summary
    Reads the value of the GPIO pin, RC10.

  @Description
    Reads the value of the GPIO pin, RC10.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    uint16_t portValue;

    // Read RC10
    postValue = IO_RC10_GetValue();
    </code>

*/
#define IO_RC10_GetValue()         PORTCbits.RC10
/**
  @Summary
    Configures the GPIO pin, RC10, as an input.

  @Description
    Configures the GPIO pin, RC10, as an input.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Sets the RC10 as an input
    IO_RC10_SetDigitalInput();
    </code>

*/
#define IO_RC10_SetDigitalInput()   ( TRISCSET = (1 << 10) )
/**
  @Summary
    Configures the GPIO pin, RC10, as an output.

  @Description
    Configures the GPIO pin, RC10, as an output.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Sets the RC10 as an output
    IO_RC10_SetDigitalOutput();
    </code>

*/
#define IO_RC10_SetDigitalOutput()   ( TRISCCLR = (1 << 10) )
/**
  @Summary
    Sets the GPIO pin, RC13, high using LATC13.

  @Description
    Sets the GPIO pin, RC13, high using LATC13.

  @Preconditions
    The RC13 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Set RC13 high (1)
    IO_RC13_SetHigh();
    </code>

*/
#define IO_RC13_SetHigh()          ( LATCSET = (1 << 13) )
/**
  @Summary
    Sets the GPIO pin, RC13, low using LATC13.

  @Description
    Sets the GPIO pin, RC13, low using LATC13.

  @Preconditions
    The RC13 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Set RC13 low (0)
    IO_RC13_SetLow();
    </code>

*/
#define IO_RC13_SetLow()           ( LATCCLR = (1 << 13) )

/**
  @Summary
    Sets a value to the GPIO pin.

  @Description
    Sets or Resets the GPIO pin, RC13, low or high using LATC13.

  @Preconditions
    The RC13 must be set to an output.

  @Returns
    None.

  @Param
    bool value; : value to be set to the GPIO pin.

  @Example
    <code>
    // Set RC13 to low.
    IO_RC13_SetValue(false);
    </code>

*/
inline static void IO_RC13_SetValue(bool value)
{
  if(value)
  {
    IO_RC13_SetHigh();
  }
  else
  {
    IO_RC13_SetLow();
  }
}

/**
  @Summary
    Toggles the GPIO pin, RC13, using LATC13.

  @Description
    Toggles the GPIO pin, RC13, using LATC13.

  @Preconditions
    The RC13 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Toggle RC13
    IO_RC13_Toggle();
    </code>

*/
#define IO_RC13_Toggle()           ( LATCINV = (1 << 13) )
/**
  @Summary
    Reads the value of the GPIO pin, RC13.

  @Description
    Reads the value of the GPIO pin, RC13.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    uint16_t portValue;

    // Read RC13
    postValue = IO_RC13_GetValue();
    </code>

*/
#define IO_RC13_GetValue()         PORTCbits.RC13
/**
  @Summary
    Configures the GPIO pin, RC13, as an input.

  @Description
    Configures the GPIO pin, RC13, as an input.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Sets the RC13 as an input
    IO_RC13_SetDigitalInput();
    </code>

*/
#define IO_RC13_SetDigitalInput()   ( TRISCSET = (1 << 13) )
/**
  @Summary
    Configures the GPIO pin, RC13, as an output.

  @Description
    Configures the GPIO pin, RC13, as an output.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Sets the RC13 as an output
    IO_RC13_SetDigitalOutput();
    </code>

*/
#define IO_RC13_SetDigitalOutput()   ( TRISCCLR = (1 << 13) )
/**
  @Summary
    Sets the GPIO pin, RC14, high using LATC14.

  @Description
    Sets the GPIO pin, RC14, high using LATC14.

  @Preconditions
    The RC14 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Set RC14 high (1)
    IO_RC14_SetHigh();
    </code>

*/
#define IO_RC14_SetHigh()          ( LATCSET = (1 << 14) )
/**
  @Summary
    Sets the GPIO pin, RC14, low using LATC14.

  @Description
    Sets the GPIO pin, RC14, low using LATC14.

  @Preconditions
    The RC14 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Set RC14 low (0)
    IO_RC14_SetLow();
    </code>

*/
#define IO_RC14_SetLow()           ( LATCCLR = (1 << 14) )

/**
  @Summary
    Sets a value to the GPIO pin.

  @Description
    Sets or Resets the GPIO pin, RC14, low or high using LATC14.

  @Preconditions
    The RC14 must be set to an output.

  @Returns
    None.

  @Param
    bool value; : value to be set to the GPIO pin.

  @Example
    <code>
    // Set RC14 to low.
    IO_RC14_SetValue(false);
    </code>

*/
inline static void IO_RC14_SetValue(bool value)
{
  if(value)
  {
    IO_RC14_SetHigh();
  }
  else
  {
    IO_RC14_SetLow();
  }
}

/**
  @Summary
    Toggles the GPIO pin, RC14, using LATC14.

  @Description
    Toggles the GPIO pin, RC14, using LATC14.

  @Preconditions
    The RC14 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Toggle RC14
    IO_RC14_Toggle();
    </code>

*/
#define IO_RC14_Toggle()           ( LATCINV = (1 << 14) )
/**
  @Summary
    Reads the value of the GPIO pin, RC14.

  @Description
    Reads the value of the GPIO pin, RC14.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    uint16_t portValue;

    // Read RC14
    postValue = IO_RC14_GetValue();
    </code>

*/
#define IO_RC14_GetValue()         PORTCbits.RC14
/**
  @Summary
    Configures the GPIO pin, RC14, as an input.

  @Description
    Configures the GPIO pin, RC14, as an input.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Sets the RC14 as an input
    IO_RC14_SetDigitalInput();
    </code>

*/
#define IO_RC14_SetDigitalInput()   ( TRISCSET = (1 << 14) )
/**
  @Summary
    Configures the GPIO pin, RC14, as an output.

  @Description
    Configures the GPIO pin, RC14, as an output.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Sets the RC14 as an output
    IO_RC14_SetDigitalOutput();
    </code>

*/
#define IO_RC14_SetDigitalOutput()   ( TRISCCLR = (1 << 14) )
/**
  @Summary
    Sets the GPIO pin, RC15, high using LATC15.

  @Description
    Sets the GPIO pin, RC15, high using LATC15.

  @Preconditions
    The RC15 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Set RC15 high (1)
    IO_RC15_SetHigh();
    </code>

*/
#define IO_RC15_SetHigh()          ( LATCSET = (1 << 15) )
/**
  @Summary
    Sets the GPIO pin, RC15, low using LATC15.

  @Description
    Sets the GPIO pin, RC15, low using LATC15.

  @Preconditions
    The RC15 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Set RC15 low (0)
    IO_RC15_SetLow();
    </code>

*/
#define IO_RC15_SetLow()           ( LATCCLR = (1 << 15) )

/**
  @Summary
    Sets a value to the GPIO pin.

  @Description
    Sets or Resets the GPIO pin, RC15, low or high using LATC15.

  @Preconditions
    The RC15 must be set to an output.

  @Returns
    None.

  @Param
    bool value; : value to be set to the GPIO pin.

  @Example
    <code>
    // Set RC15 to low.
    IO_RC15_SetValue(false);
    </code>

*/
inline static void IO_RC15_SetValue(bool value)
{
  if(value)
  {
    IO_RC15_SetHigh();
  }
  else
  {
    IO_RC15_SetLow();
  }
}

/**
  @Summary
    Toggles the GPIO pin, RC15, using LATC15.

  @Description
    Toggles the GPIO pin, RC15, using LATC15.

  @Preconditions
    The RC15 must be set to an output.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    // Toggle RC15
    IO_RC15_Toggle();
    </code>

*/
#define IO_RC15_Toggle()           ( LATCINV = (1 << 15) )
/**
  @Summary
    Reads the value of the GPIO pin, RC15.

  @Description
    Reads the value of the GPIO pin, RC15.

  @Preconditions
    None.

  @Returns
    None.

  @Param
    None.

  @Example
    <code>
    uint16_t portValue;

